Show / Hide Table of Contents
Interface IConnHiddenCheck
Provides seamlessly data about connections or allows to run hidden calculation of a connection
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[ServiceContract]
public interface IConnHiddenCheck
Methods
Improve this Doc   View Source
AddBoltAssembly(String)
Add the new bolt assembly. Its type is defined by its name (e.g. 'M12 4.6')
Declaration
[OperationContract]
int AddBoltAssembly(string boltAssemblyName)
Parameters
 Type |  Name |  Description
 System.String |  boltAssemblyName
Returns
 Type |  Description
 System.Int32
Improve this Doc   View Source
ApplyParameters(String, String)
Apply parametersJSON on connectionconnectionId IOM Parameters
Declaration
[OperationContract]
string ApplyParameters(string connectionId, string parametersJSON)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Id of the parameter
 System.String |  parametersJSON
JSON string including parameters
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ApplySimpleTemplate(String, String, ApplyConnTemplateSetting, Int32, List<Int32>)
Apply the simple connectionsimple template from file templateFilePath on connection connectionId
Declaration
[OperationContract]
string ApplySimpleTemplate(string connectionId, string templateFilePath, ApplyConnTemplateSetting connTemplateSetting, int mainMember, List<int> attachedMembers)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
The id of the connection on which templete will be applied
 System.String |  templateFilePath
The path to the connection teplate
 ApplyConnTemplateSetting |  connTemplateSetting
The additional settings - e.g. default bolts
 System.Int32 |  mainMember
Main (supporting member)
 System.Collections.Generic.List<System.Int32> |  attachedMembers
The list of members which are supported by mainMember
Returns
 Type |  Description
 System.String
Returns 'Ok' in case of the success otherwise 'Fail'
Improve this Doc   View Source
ApplyTemplate(String, String, ApplyConnTemplateSetting)
Apply the selected template in file conTemplateFileName on connection connectionId
Declaration
[OperationContract]
string ApplyTemplate(string connectionId, string conTemplateFileName, ApplyConnTemplateSetting connTemplateSetting)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Identifier of the connection in the project, empty guid means the first connection in the project
 System.String |  conTemplateFileName
contemp filename including connection template
 ApplyConnTemplateSetting |  connTemplateSetting
Additional setting for application of the template.
Returns
 Type |  Description
 System.String
returns 'OK' if success otherwise an error message
Improve this Doc   View Source
Calculate(String)
Cakculate connection given by connectionId
Declaration
[OperationContract]
ConnectionResultsData Calculate(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
The identifier of the required connection
Returns
 Type |  Description
 ConnectionResultsData
Connection check results
Improve this Doc   View Source
Cancel()
Cancel current calcullation
Declaration
[OperationContract]
void Cancel()
Improve this Doc   View Source
CloseProject()
Close project which is open in the service
Declaration
[OperationContract]
void CloseProject()
Improve this Doc   View Source
CreateConProjFromIOM(String, String, String)
Creates Idea connection project from given iomXmlFileName, iomResXmlFileName and projects saves into the newIdeaConFileName
Declaration
[OperationContract]
void CreateConProjFromIOM(string iomXmlFileName, string iomResXmlFileName, string newIdeaConFileName)
Parameters
 Type |  Name |  Description
 System.String |  iomXmlFileName
Filename of a given IOM xml file
 System.String |  iomResXmlFileName
Filename of a given IOM Result xml file
 System.String |  newIdeaConFileName
File name of idea connection project where generated project will be saved
Improve this Doc   View Source
EvaluateExpression(String, String, String)
Evaluate expression on connection model connectionId
Declaration
[OperationContract]
string EvaluateExpression(string connectionId, string expression, string arumentsJSON)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Id of the connection in the open idea connection project
 System.String |  expression
User expression to be evaluated
 System.String |  arumentsJSON
Optional agruments in json format (not used now)
Returns
 Type |  Description
 System.String
In case of a success it is the JSON string representing the result of the query. String 'null' if nothing is found. String 'error' in case of any other unspecified error.
Improve this Doc   View Source
ExportToTemplate(String, String)
Export the manufacture sequence of connectionId as a template and save it in conTemplateFileName (.contemp file)
Declaration
[OperationContract]
string ExportToTemplate(string connectionId, string conTemplateFileName)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Identifier of the connection in the project, empty guid means the first connection in the project
 System.String |  conTemplateFileName
The file name of the output file
Returns
 Type |  Description
 System.String
returns 'OK' if success otherwise an error message
Improve this Doc   View Source
GetAllConnectionData(String)
Get structural data and corresponding results of FE analysi for connectionId
Declaration
[OperationContract]
string GetAllConnectionData(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Identifier of the required connection
Returns
 Type |  Description
 System.String
XML string which prepresents the instance of of IdeaRS.OpenModel.OpenModelContainer (stuctural data and results of FE analysis)
Improve this Doc   View Source
GetBoltAssembliesInProject()
Get all bolt assemblies in the currently open project
Declaration
[OperationContract]
List<ProjectItem> GetBoltAssembliesInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Bolt assemblies in the project
Improve this Doc   View Source
GetConnectionLoadingJSON(String)
Get loading for connection connectionId (List of CalcCaseData)
Declaration
[OperationContract]
string GetConnectionLoadingJSON(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Id of the parameter
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetConnectionModel(String)
Get the geometry of the connectionId
Declaration
[OperationContract]
ConnectionData GetConnectionModel(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Identifier of the required connection
Returns
 Type |  Description
 ConnectionData
Geometry of the connection in the IOM format
Improve this Doc   View Source
GetConnectionModelXML(String)
Get the geometry of the connectionId
Declaration
[OperationContract]
string GetConnectionModelXML(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Identifier of the required connection
Returns
 Type |  Description
 System.String
Geometry of the connection in the Xml format
Improve this Doc   View Source
GetCrossSectionsInProject()
Get all cross-sections in the currently open project
Declaration
[OperationContract]
List<ProjectItem> GetCrossSectionsInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Cross-sections in the project
Improve this Doc   View Source
GetCheckResultsJSON(String)
Get the details results of the connection connectionId
Declaration
[OperationContract]
string GetCheckResultsJSON(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Id of the connection
Returns
 Type |  Description
 System.String
Json which represents
Improve this Doc   View Source
GetMaterialsInProject()
Get all materials in the currently open project
Declaration
[OperationContract]
List<ProjectItem> GetMaterialsInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Materials in the project
Improve this Doc   View Source
GetParametersJSON(String)
Get list of parameters in JSON format for connectionId IOM Parameters
Declaration
[OperationContract]
string GetParametersJSON(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Id of the parameter
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetProjectInfo()
Gets details about the open project and its connections
Declaration
[OperationContract]
ConProjectInfo GetProjectInfo()
Returns
 Type |  Description
 ConProjectInfo
Improve this Doc   View Source
OpenProject(String)
Open idea project in the service
Declaration
[OperationContract]
void OpenProject(string ideaConProject)
Parameters
 Type |  Name |  Description
 System.String |  ideaConProject
Idea Connection project.
Improve this Doc   View Source
SaveAsProject(String)
Save the current data in file newProjectFileName
Declaration
[OperationContract]
void SaveAsProject(string newProjectFileName)
Parameters
 Type |  Name |  Description
 System.String |  newProjectFileName
File name of the new idea connection project
Improve this Doc   View Source
UpdateLoadingFromJson(String, String)
Set loading for the connection
Declaration
[OperationContract]
string UpdateLoadingFromJson(string connectionId, string loadingJSON)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Id of the connection
 System.String |  loadingJSON
JSON including list of CalcCaseData
Returns
 Type |  Description
 System.String
 Improve this Doc
 View Source